BUHTOOLS/src/DataProcessors/ПолучитьДанныеРДЛ/ПолучитьДанныеРДЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПолучитьДанныеРДЛ</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеРДЛТелеком</name>
    <attributes>
      <name>Code</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Fee</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OrderID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentTime</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Phone</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>35</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RefundTime</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

BUHTOOLS/src/InformationRegisters/ДанныеРДЛТелеком/ДанныеРДЛТелеком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеРДЛТелеком</name>
  <resources>
    <name>Fee</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RefundTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentTime</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Code</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>OrderID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BUHTOOLS/src/DataProcessors/ПолучитьДанныеРДЛ/Forms/Форма/Module.bsl
&НаСервере
Процедура ПолучитьДанныеТелекомНаСервере()
	// Вставить содержимое обработчика.
	Объект.ДанныеРДЛТелеком.Очистить();
	//Сервер = "internet.rdl.club";
	//
	//Попытка
	//	HTTP =  Новый HTTPСоединение(Сервер,,,,,Истина);
	//Исключение
	//КонецПопытки ;
	//СтартоваяДата = Формат(Объект.НачалоПериода,"ДФ='yyyy-MM-dd ЧЧ:мм:сс'");
	//КодироватьСтроку(СтартоваяДата,СпособКодированияСтроки.КодировкаURL);
	//СтартоваяДата =СтрЗаменить(СтартоваяДата," ","%20");
	//КонечнаяДата =  Формат(Объект.КонецПериода,"ДФ='yyyy-MM-dd ЧЧ:мм:сс'");
	//КодироватьСтроку(КонечнаяДата,СпособКодированияСтроки.КодировкаURL);
	//КонечнаяДата = СтрЗаменить(КонечнаяДата," ","%20");
	//
	//Ресурс = "getStatistics?";
	//Если ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
	//	Ресурс = Ресурс + "startTime=" + СтартоваяДата;
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(Объект.КонецПериода) Тогда
	//	Ресурс = Ресурс +"&endTime=" + КонечнаяДата;
	//КонецЕсли;
	//
	//
	//
	//HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	//
	//ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();	 
	//HTTPОтвет = HTTP.Получить(HTTPЗапрос,ИмяФайлаОтвета);
	//
	//ЧтениеJSON = Новый ЧтениеJSON;
	//ЧтениеJSON.ОткрытьФайл(ИмяФайлаОтвета);
	//Данные = ПрочитатьJSON(ЧтениеJSON);
	//ЧтениеJSON.Закрыть();
	//Для Каждого Строка Из Данные.Statistics Цикл 
	//	НоваяСтрокаДанных = Объект.ДанныеРДЛТелеком.Добавить(); 
	//	ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных,Строка);
	//	//ПреобразуемДаты
	//	НоваяСтрокаДанных.PaymentTime = ПреобразоватьДатуJson(Строка.PaymentTime);
	//	НоваяСтрокаДанных.RefundTime = ПреобразоватьДатуJson(Строка.RefundTime);
	//КонецЦикла;
	
	ДанныеРдл = Обработки.ПолучитьДанныеРДЛ.ПолучитьДанныеРДЛТелекомЗаПериод(Объект.НачалоПериода,Объект.КонецПериода);
	
	Для Каждого Строка Из ДанныеРдл Цикл 
		НоваяСтрокаДанных = Объект.ДанныеРДЛТелеком.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных,Строка);
		//ПреобразуемДаты
		НоваяСтрокаДанных.PaymentTime = РДЛТелеком.ПреобразоватьДатуJson(Строка.PaymentTime);
		Попытка
			НоваяСтрокаДанных.RefundTime =  РДЛТелеком.ПреобразоватьДатуJson(Строка.RefundTime);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьДанныеТелеком(Команда)
	ПолучитьДанныеТелекомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	// Вставить содержимое обработчика.
	Для Каждого Строка ИЗ Объект.ДанныеРДЛТелеком Цикл
		МенеджерЗаписи = РегистрыСведений.ДанныеРДЛТелеком.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,строка);
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	ЗаписатьДанныеНаСервере();
КонецПроцедуры
